def nextDay(daystr):
    
    monthDays = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    
    day = int(daystr[:2])
    month = int(daystr[3:5])
    year = int(daystr[6:])

    #1.Ελέγχουμε το υπόλοιπο της ακέραιας διαίρεσης του έτους με το 4.
    #Αν είναι μηδέν ελέγχουμε το υπόλοιπο της ακέραιας διαίρεσης του έτους με το 100. Αν αυτό το υπόλοιπο είναι διαφορετικό του μηδενός τότε το έτος είναι δίσεκτο.
    #2.Αν από τον έλεγχο 1 δεν προκύψει ότι το έτος είναι δίσεκτο ελέγχουμε το υπόλοιπο της ακέραιας διαίρεσης του έτους με το 400.
    #Αν είναι μηδέν τότε το έτος είναι δίσεκτο, άσχετα από το αποτέλεσμα του ελέγχου 1.

    if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0): monthDays[1] = 29

    day += 1

    if day > monthDays[month - 1]:
        day = 1
        month += 1

    if month > 12:
        month = 1
        year += 1

    print('{:02d}-{:02d}-{:4d}'.format(day, month, year))

while True:

    data = input()

    if data == 'END' or data == 'end':
        break

    nextDay(data)
