##################################################
# Η μορφοποιση των εξόδων μπορεί να μην συμφωνει # 
# με την εκφώνηση της εργασίας                   #
# καθώς δεν υπήρχε διαθέσιμη η εκφώνηση          #
##################################################
a, b, c = input().split(',')
a, b, c = float(a), float(b), float(c)

D = b ** 2 - 4 * a * c

if D >0:
    x1 = (-b + D ** 0.5) / (2 * a)
    x2 = (-b - D ** 0.5) / (2 * a)
    print('x1={}, x2={}'.format(x1, x2))
elif D == 0:
    x = -b / (2 * a)
    print('x={}'.format(x))
else:
    D = - D
    x1 = complex(-b / (2 * a), D ** 0.5 / (2 * a))
    x2 = complex(-b / (2 * a), - D ** 0.5 / (2 * a))
    print('x1={}, x2={}'.format(x1, x2))


